app/controllers/chagas_controller.rb

  def index
    @chagas = Chaga.all
---
SELECT "chagas".* FROM "chagas"

  def create
    @chaga = Chaga.new(chaga_params)

    respond_to do |format|
      if @chaga.save
---
INSERT INTO "chagas" ("created_at", "fecha_entrega", "fecha_toma_muestra_chagas", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def destroy
    @chaga.destroy
---
DELETE FROM "chagas" WHERE "chagas"."id" = $1  [["id", 1]]

    def set_chaga
      @chaga = Chaga.find(params[:id])
---
SELECT "chagas".* FROM "chagas" WHERE "chagas"."id" = $1 LIMIT 1  [["id", "index"]]