app/controllers/datos_insumos_reactivos_controller.rb

  def index
    @datos_insumos_reactivos = DatosInsumosReactivo.all
---
SELECT "datos_insumos_reactivos".* FROM "datos_insumos_reactivos"

    def set_datos_insumos_reactivo
      @datos_insumos_reactivo = DatosInsumosReactivo.find(params[:id])
---
SELECT "datos_insumos_reactivos".* FROM "datos_insumos_reactivos" WHERE "datos_insumos_reactivos"."id" = $1 LIMIT 1  [["id", "insumos_reactivos"]]