app/controllers/insumos_reactivos_controller.rb

SELECT "insumos_reactivos".* FROM "insumos_reactivos"
---
  def index
    if  session[rol] == admin
      @insumos_reactivos = InsumosReactivo.all

SELECT "insumos_reactivos".* FROM "insumos_reactivos" WHERE "insumos_reactivos"."id" = $1 LIMIT 1  [["id", "registro_insumos_reactivos"]]
---
  def set_insumos_reactivo
    @insumos_reactivo = InsumosReactivo.find(params[:id])