app/controllers/lab_anat_pats_controller.rb

SELECT "lab_anat_pats".* FROM "lab_anat_pats"
---
  def index
    @lab_anat_pats = LabAnatPat.all