app/controllers/lab_anat_cits_controller.rb

  def index
    @lab_anat_cits = LabAnatCit.all
---
SELECT "lab_anat_cits".* FROM "lab_anat_cits"