app/controllers/lab_cancer_uterinos_controller.rb

SELECT "lab_cancer_uterinos".* FROM "lab_cancer_uterinos"
---
  def index
    @lab_cancer_uterinos = LabCancerUterino.all