app/controllers/pacientes_controller.rb

  def index
    @pacientes = Paciente.all
---
SELECT "pacientes".* FROM "pacientes"