app/controllers/registro_insumos_reactivos_controller.rb

  def index
    @registro_insumos_reactivos = RegistroInsumosReactivo.all
---
SELECT "registro_insumos_reactivos".* FROM "registro_insumos_reactivos"